<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"449db3a34c6ea7c6002616cd72f3fb779bef9e7e7747d3c92bd6586ebfecf3a2","plan_job_ref":"Job CICD for Splitrr Infra #57 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10677913551","plan_out_hash":"6142b51642c396893fd4f26b34c34e624aeb812539f93d9772cce0bc4bcc4a59","plan_hash":"5dc1d372bf6643d4b41c674c2463856967b2886f1f1d14f89f0edfadf04046f9","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "d2kv2y9eh8mtkp.cloudfront.net"
+           zone_id                = "**************"
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be updated in-place
!~  resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:949263681218:service/EC2-ECS-CLUSTER/splitrr-dev-backend-ecs-ec2-service"
        name                               = "splitrr-dev-backend-ecs-ec2-service"
        tags                               = {
            "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:5" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:5" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ]
        )
!~      id                       = "************************************" -> (known after apply)
!~      memory                   = "701" -> "700" # forces replacement
!~      revision                 = 5 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (11 unchanged attributes hidden)
    }

  # module.ecs-ec2.aws_iam_policy.ecs_task_policy will be updated in-place
!~  resource "aws_iam_policy" "ecs_task_policy" {
        id               = "arn:aws:iam::949263681218:policy/splitrr-dev-backend-ecs-ec2-ecs-task-policy"
        name             = "splitrr-dev-backend-ecs-ec2-ecs-task-policy"
!~      policy           = jsonencode(
!~          {
!~              Statement = [
!~                  {
!~                      Resource = "arn:aws:cognito-idp:us-east-1:949263681218:userpool/us-east-1_PWaBopkF0" -> "arn:aws:cognito-idp:us-east-1:949263681218:userpool/us-east-1_gmFGld90u"
#                        (2 unchanged attributes hidden)
                    },
                ]
#                (1 unchanged attribute hidden)
            }
        )
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #57](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10677913551)